
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ДобавляемыеРеквизиты = Новый Массив();
	
	ТипПланировщик = Новый ОписаниеТипов("Планировщик");
	
	НовыйРеквизит = Новый РеквизитФормы("Планировщик", ТипПланировщик);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	НовыйЭлемент = Элементы.Добавить("Планировщик", Тип("ПолеФормы"), Элементы.ГруппаПланировщик);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеПланировщика;
	НовыйЭлемент.ПутьКДанным = "Планировщик";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПланировщик(Команда)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьНастройки(Команда)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
