
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ДобавитьРеквизитИЭлементУправленияПланировщика();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПланировщик(Команда)
	//TODO: Вставить содержимое обработчика}
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьНастройки(Команда)

	НовоеЗначение = Не Элементы.ГруппаНастройки.Видимость;
	
	Элементы.ГруппаНастройки.Видимость = НовоеЗначение;
	Элементы.ФормаСкрытьПоказатьНастройки.Пометка = НовоеЗначение;

КонецПроцедуры

&НаКлиенте
Процедура ВариантПоложенияШкалыВремениПриИзменении(Элемент)

	ОбновитьПланировщик(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтображенияВремениЭлементовПланировщикаПриИзменении(Элемент)

	ОбновитьПланировщик(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаПериодическогоВариантаПриИзменении(Элемент)

	ОбновитьПланировщик(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура КратностьПериодическогоВариантаРегулирование(Элемент, Направление, СтандартнаяОбработка)

	ОбновитьПланировщик(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьПеренесенныеЗаголовкиПриИзменении(Элемент)

	ОбновитьПланировщик(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьТекущуюДатуПриИзменении(Элемент)

	ОбновитьПланировщик(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьПеренесенныеЗаголовкиШкалыВремениПриИзменении(Элемент)

	ОбновитьПланировщик(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыравниватьГраницыЭлементовПоШкалеВремениПриИзменении(Элемент)

	ОбновитьПланировщик(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущиеПериодыОтображенияПриИзменении(Элемент)

	ОбновитьПланировщик(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущиеПериодыОтображенияДатаНачалаПриИзменении(Элемент)

	ОбновитьПланировщик(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущиеПериодыОтображенияДатаОкончанияПриИзменении(Элемент)

	ОбновитьПланировщик(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыШкалыВремениПриИзменении(Элемент)

	ОбновитьПланировщик(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыШкалыВремениЕдиницаПриИзменении(Элемент)

	ОбновитьПланировщик(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыШкалыВремениКратностьПриИзменении(Элемент)

	ОбновитьПланировщик(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыШкалыВремениФорматПриИзменении(Элемент)

	ОбновитьПланировщик(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоИзмеренийПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ДеревоИзмеренийЗначениеПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПланировщикаПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры







#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьРеквизитИЭлементУправленияПланировщика()
	
	// Добавляю реквизит
	ДобавляемыеРеквизиты = Новый Массив();
	
	ТипПланировщик = Новый ОписаниеТипов("Планировщик");
	
	НовыйРеквизит = Новый РеквизитФормы("Планировщик", ТипПланировщик);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	// Добавляю элемент управления
	НовыйЭлемент = Элементы.Добавить("Планировщик", Тип("ПолеФормы"), Элементы.ГруппаПланировщик);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеПланировщика;
	НовыйЭлемент.ПутьКДанным = "Планировщик";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	
КонецПроцедуры


#КонецОбласти
